; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-x10-y10-t4-k5555-l5555-p50-neargoal-d20)
(:domain grid)
(:objects f0-0f f1-0f f2-0f f3-0f f4-0f f5-0f f6-0f f7-0f f8-0f f9-0f f0-1f f1-1f f2-1f f3-1f f4-1f f5-1f f6-1f f7-1f f8-1f f9-1f f0-2f f1-2f f2-2f f3-2f f4-2f f5-2f f6-2f f7-2f f8-2f f9-2f f0-3f f1-3f f2-3f f3-3f f4-3f f5-3f f6-3f f7-3f f8-3f f9-3f f0-4f f1-4f f2-4f f3-4f f4-4f f5-4f f6-4f f7-4f f8-4f f9-4f f0-5f f1-5f f2-5f f3-5f f4-5f f5-5f f6-5f f7-5f f8-5f f9-5f f0-6f f1-6f f2-6f f3-6f f4-6f f5-6f f6-6f f7-6f f8-6f f9-6f f0-7f f1-7f f2-7f f3-7f f4-7f f5-7f f6-7f f7-7f f8-7f f9-7f f0-8f f1-8f f2-8f f3-8f f4-8f f5-8f f6-8f f7-8f f8-8f f9-8f f0-9f f1-9f f2-9f f3-9f f4-9f f5-9f f6-9f f7-9f f8-9f f9-9f shape0 shape1 shape2 shape3 key0-0 key0-1 key0-2 key0-3 key0-4 key1-0 key1-1 key1-2 key1-3 key1-4 key2-0 key2-1 key2-2 key2-3 key2-4 key3-0 key3-1 key3-2 key3-3 key3-4)
(:init
(arm-empty)
(at key0-0 f0-2f)
(at key0-1 f3-6f)
(at key0-2 f9-7f)
(at key0-3 f5-6f)
(at key0-4 f3-9f)
(at key1-0 f0-9f)
(at key1-1 f6-7f)
(at key1-2 f0-6f)
(at key1-3 f2-0f)
(at key1-4 f9-4f)
(at key2-0 f3-3f)
(at key2-1 f7-6f)
(at key2-2 f8-4f)
(at key2-3 f9-9f)
(at key2-4 f0-0f)
(at key3-0 f0-4f)
(at key3-1 f4-8f)
(at key3-2 f2-4f)
(at key3-3 f1-7f)
(at key3-4 f3-4f)
(at-robot f6-6f)
(conn f0-0f f0-1f)
(conn f0-0f f1-0f)
(conn f0-1f f0-0f)
(conn f0-1f f0-2f)
(conn f0-1f f1-1f)
(conn f0-2f f0-1f)
(conn f0-2f f0-3f)
(conn f0-2f f1-2f)
(conn f0-3f f0-2f)
(conn f0-3f f0-4f)
(conn f0-3f f1-3f)
(conn f0-4f f0-3f)
(conn f0-4f f0-5f)
(conn f0-4f f1-4f)
(conn f0-5f f0-4f)
(conn f0-5f f0-6f)
(conn f0-5f f1-5f)
(conn f0-6f f0-5f)
(conn f0-6f f0-7f)
(conn f0-6f f1-6f)
(conn f0-7f f0-6f)
(conn f0-7f f0-8f)
(conn f0-7f f1-7f)
(conn f0-8f f0-7f)
(conn f0-8f f0-9f)
(conn f0-8f f1-8f)
(conn f0-9f f0-8f)
(conn f0-9f f1-9f)
(conn f1-0f f0-0f)
(conn f1-0f f1-1f)
(conn f1-0f f2-0f)
(conn f1-1f f0-1f)
(conn f1-1f f1-0f)
(conn f1-1f f1-2f)
(conn f1-1f f2-1f)
(conn f1-2f f0-2f)
(conn f1-2f f1-1f)
(conn f1-2f f1-3f)
(conn f1-2f f2-2f)
(conn f1-3f f0-3f)
(conn f1-3f f1-2f)
(conn f1-3f f1-4f)
(conn f1-3f f2-3f)
(conn f1-4f f0-4f)
(conn f1-4f f1-3f)
(conn f1-4f f1-5f)
(conn f1-4f f2-4f)
(conn f1-5f f0-5f)
(conn f1-5f f1-4f)
(conn f1-5f f1-6f)
(conn f1-5f f2-5f)
(conn f1-6f f0-6f)
(conn f1-6f f1-5f)
(conn f1-6f f1-7f)
(conn f1-6f f2-6f)
(conn f1-7f f0-7f)
(conn f1-7f f1-6f)
(conn f1-7f f1-8f)
(conn f1-7f f2-7f)
(conn f1-8f f0-8f)
(conn f1-8f f1-7f)
(conn f1-8f f1-9f)
(conn f1-8f f2-8f)
(conn f1-9f f0-9f)
(conn f1-9f f1-8f)
(conn f1-9f f2-9f)
(conn f2-0f f1-0f)
(conn f2-0f f2-1f)
(conn f2-0f f3-0f)
(conn f2-1f f1-1f)
(conn f2-1f f2-0f)
(conn f2-1f f2-2f)
(conn f2-1f f3-1f)
(conn f2-2f f1-2f)
(conn f2-2f f2-1f)
(conn f2-2f f2-3f)
(conn f2-2f f3-2f)
(conn f2-3f f1-3f)
(conn f2-3f f2-2f)
(conn f2-3f f2-4f)
(conn f2-3f f3-3f)
(conn f2-4f f1-4f)
(conn f2-4f f2-3f)
(conn f2-4f f2-5f)
(conn f2-4f f3-4f)
(conn f2-5f f1-5f)
(conn f2-5f f2-4f)
(conn f2-5f f2-6f)
(conn f2-5f f3-5f)
(conn f2-6f f1-6f)
(conn f2-6f f2-5f)
(conn f2-6f f2-7f)
(conn f2-6f f3-6f)
(conn f2-7f f1-7f)
(conn f2-7f f2-6f)
(conn f2-7f f2-8f)
(conn f2-7f f3-7f)
(conn f2-8f f1-8f)
(conn f2-8f f2-7f)
(conn f2-8f f2-9f)
(conn f2-8f f3-8f)
(conn f2-9f f1-9f)
(conn f2-9f f2-8f)
(conn f2-9f f3-9f)
(conn f3-0f f2-0f)
(conn f3-0f f3-1f)
(conn f3-0f f4-0f)
(conn f3-1f f2-1f)
(conn f3-1f f3-0f)
(conn f3-1f f3-2f)
(conn f3-1f f4-1f)
(conn f3-2f f2-2f)
(conn f3-2f f3-1f)
(conn f3-2f f3-3f)
(conn f3-2f f4-2f)
(conn f3-3f f2-3f)
(conn f3-3f f3-2f)
(conn f3-3f f3-4f)
(conn f3-3f f4-3f)
(conn f3-4f f2-4f)
(conn f3-4f f3-3f)
(conn f3-4f f3-5f)
(conn f3-4f f4-4f)
(conn f3-5f f2-5f)
(conn f3-5f f3-4f)
(conn f3-5f f3-6f)
(conn f3-5f f4-5f)
(conn f3-6f f2-6f)
(conn f3-6f f3-5f)
(conn f3-6f f3-7f)
(conn f3-6f f4-6f)
(conn f3-7f f2-7f)
(conn f3-7f f3-6f)
(conn f3-7f f3-8f)
(conn f3-7f f4-7f)
(conn f3-8f f2-8f)
(conn f3-8f f3-7f)
(conn f3-8f f3-9f)
(conn f3-8f f4-8f)
(conn f3-9f f2-9f)
(conn f3-9f f3-8f)
(conn f3-9f f4-9f)
(conn f4-0f f3-0f)
(conn f4-0f f4-1f)
(conn f4-0f f5-0f)
(conn f4-1f f3-1f)
(conn f4-1f f4-0f)
(conn f4-1f f4-2f)
(conn f4-1f f5-1f)
(conn f4-2f f3-2f)
(conn f4-2f f4-1f)
(conn f4-2f f4-3f)
(conn f4-2f f5-2f)
(conn f4-3f f3-3f)
(conn f4-3f f4-2f)
(conn f4-3f f4-4f)
(conn f4-3f f5-3f)
(conn f4-4f f3-4f)
(conn f4-4f f4-3f)
(conn f4-4f f4-5f)
(conn f4-4f f5-4f)
(conn f4-5f f3-5f)
(conn f4-5f f4-4f)
(conn f4-5f f4-6f)
(conn f4-5f f5-5f)
(conn f4-6f f3-6f)
(conn f4-6f f4-5f)
(conn f4-6f f4-7f)
(conn f4-6f f5-6f)
(conn f4-7f f3-7f)
(conn f4-7f f4-6f)
(conn f4-7f f4-8f)
(conn f4-7f f5-7f)
(conn f4-8f f3-8f)
(conn f4-8f f4-7f)
(conn f4-8f f4-9f)
(conn f4-8f f5-8f)
(conn f4-9f f3-9f)
(conn f4-9f f4-8f)
(conn f4-9f f5-9f)
(conn f5-0f f4-0f)
(conn f5-0f f5-1f)
(conn f5-0f f6-0f)
(conn f5-1f f4-1f)
(conn f5-1f f5-0f)
(conn f5-1f f5-2f)
(conn f5-1f f6-1f)
(conn f5-2f f4-2f)
(conn f5-2f f5-1f)
(conn f5-2f f5-3f)
(conn f5-2f f6-2f)
(conn f5-3f f4-3f)
(conn f5-3f f5-2f)
(conn f5-3f f5-4f)
(conn f5-3f f6-3f)
(conn f5-4f f4-4f)
(conn f5-4f f5-3f)
(conn f5-4f f5-5f)
(conn f5-4f f6-4f)
(conn f5-5f f4-5f)
(conn f5-5f f5-4f)
(conn f5-5f f5-6f)
(conn f5-5f f6-5f)
(conn f5-6f f4-6f)
(conn f5-6f f5-5f)
(conn f5-6f f5-7f)
(conn f5-6f f6-6f)
(conn f5-7f f4-7f)
(conn f5-7f f5-6f)
(conn f5-7f f5-8f)
(conn f5-7f f6-7f)
(conn f5-8f f4-8f)
(conn f5-8f f5-7f)
(conn f5-8f f5-9f)
(conn f5-8f f6-8f)
(conn f5-9f f4-9f)
(conn f5-9f f5-8f)
(conn f5-9f f6-9f)
(conn f6-0f f5-0f)
(conn f6-0f f6-1f)
(conn f6-0f f7-0f)
(conn f6-1f f5-1f)
(conn f6-1f f6-0f)
(conn f6-1f f6-2f)
(conn f6-1f f7-1f)
(conn f6-2f f5-2f)
(conn f6-2f f6-1f)
(conn f6-2f f6-3f)
(conn f6-2f f7-2f)
(conn f6-3f f5-3f)
(conn f6-3f f6-2f)
(conn f6-3f f6-4f)
(conn f6-3f f7-3f)
(conn f6-4f f5-4f)
(conn f6-4f f6-3f)
(conn f6-4f f6-5f)
(conn f6-4f f7-4f)
(conn f6-5f f5-5f)
(conn f6-5f f6-4f)
(conn f6-5f f6-6f)
(conn f6-5f f7-5f)
(conn f6-6f f5-6f)
(conn f6-6f f6-5f)
(conn f6-6f f6-7f)
(conn f6-6f f7-6f)
(conn f6-7f f5-7f)
(conn f6-7f f6-6f)
(conn f6-7f f6-8f)
(conn f6-7f f7-7f)
(conn f6-8f f5-8f)
(conn f6-8f f6-7f)
(conn f6-8f f6-9f)
(conn f6-8f f7-8f)
(conn f6-9f f5-9f)
(conn f6-9f f6-8f)
(conn f6-9f f7-9f)
(conn f7-0f f6-0f)
(conn f7-0f f7-1f)
(conn f7-0f f8-0f)
(conn f7-1f f6-1f)
(conn f7-1f f7-0f)
(conn f7-1f f7-2f)
(conn f7-1f f8-1f)
(conn f7-2f f6-2f)
(conn f7-2f f7-1f)
(conn f7-2f f7-3f)
(conn f7-2f f8-2f)
(conn f7-3f f6-3f)
(conn f7-3f f7-2f)
(conn f7-3f f7-4f)
(conn f7-3f f8-3f)
(conn f7-4f f6-4f)
(conn f7-4f f7-3f)
(conn f7-4f f7-5f)
(conn f7-4f f8-4f)
(conn f7-5f f6-5f)
(conn f7-5f f7-4f)
(conn f7-5f f7-6f)
(conn f7-5f f8-5f)
(conn f7-6f f6-6f)
(conn f7-6f f7-5f)
(conn f7-6f f7-7f)
(conn f7-6f f8-6f)
(conn f7-7f f6-7f)
(conn f7-7f f7-6f)
(conn f7-7f f7-8f)
(conn f7-7f f8-7f)
(conn f7-8f f6-8f)
(conn f7-8f f7-7f)
(conn f7-8f f7-9f)
(conn f7-8f f8-8f)
(conn f7-9f f6-9f)
(conn f7-9f f7-8f)
(conn f7-9f f8-9f)
(conn f8-0f f7-0f)
(conn f8-0f f8-1f)
(conn f8-0f f9-0f)
(conn f8-1f f7-1f)
(conn f8-1f f8-0f)
(conn f8-1f f8-2f)
(conn f8-1f f9-1f)
(conn f8-2f f7-2f)
(conn f8-2f f8-1f)
(conn f8-2f f8-3f)
(conn f8-2f f9-2f)
(conn f8-3f f7-3f)
(conn f8-3f f8-2f)
(conn f8-3f f8-4f)
(conn f8-3f f9-3f)
(conn f8-4f f7-4f)
(conn f8-4f f8-3f)
(conn f8-4f f8-5f)
(conn f8-4f f9-4f)
(conn f8-5f f7-5f)
(conn f8-5f f8-4f)
(conn f8-5f f8-6f)
(conn f8-5f f9-5f)
(conn f8-6f f7-6f)
(conn f8-6f f8-5f)
(conn f8-6f f8-7f)
(conn f8-6f f9-6f)
(conn f8-7f f7-7f)
(conn f8-7f f8-6f)
(conn f8-7f f8-8f)
(conn f8-7f f9-7f)
(conn f8-8f f7-8f)
(conn f8-8f f8-7f)
(conn f8-8f f8-9f)
(conn f8-8f f9-8f)
(conn f8-9f f7-9f)
(conn f8-9f f8-8f)
(conn f8-9f f9-9f)
(conn f9-0f f8-0f)
(conn f9-0f f9-1f)
(conn f9-1f f8-1f)
(conn f9-1f f9-0f)
(conn f9-1f f9-2f)
(conn f9-2f f8-2f)
(conn f9-2f f9-1f)
(conn f9-2f f9-3f)
(conn f9-3f f8-3f)
(conn f9-3f f9-2f)
(conn f9-3f f9-4f)
(conn f9-4f f8-4f)
(conn f9-4f f9-3f)
(conn f9-4f f9-5f)
(conn f9-5f f8-5f)
(conn f9-5f f9-4f)
(conn f9-5f f9-6f)
(conn f9-6f f8-6f)
(conn f9-6f f9-5f)
(conn f9-6f f9-7f)
(conn f9-7f f8-7f)
(conn f9-7f f9-6f)
(conn f9-7f f9-8f)
(conn f9-8f f8-8f)
(conn f9-8f f9-7f)
(conn f9-8f f9-9f)
(conn f9-9f f8-9f)
(conn f9-9f f9-8f)
(key key0-0)
(key key0-1)
(key key0-2)
(key key0-3)
(key key0-4)
(key key1-0)
(key key1-1)
(key key1-2)
(key key1-3)
(key key1-4)
(key key2-0)
(key key2-1)
(key key2-2)
(key key2-3)
(key key2-4)
(key key3-0)
(key key3-1)
(key key3-2)
(key key3-3)
(key key3-4)
(key-shape key0-0 shape0)
(key-shape key0-1 shape0)
(key-shape key0-2 shape0)
(key-shape key0-3 shape0)
(key-shape key0-4 shape0)
(key-shape key1-0 shape1)
(key-shape key1-1 shape1)
(key-shape key1-2 shape1)
(key-shape key1-3 shape1)
(key-shape key1-4 shape1)
(key-shape key2-0 shape2)
(key-shape key2-1 shape2)
(key-shape key2-2 shape2)
(key-shape key2-3 shape2)
(key-shape key2-4 shape2)
(key-shape key3-0 shape3)
(key-shape key3-1 shape3)
(key-shape key3-2 shape3)
(key-shape key3-3 shape3)
(key-shape key3-4 shape3)
(lock-shape f0-6f shape3)
(lock-shape f0-7f shape2)
(lock-shape f0-8f shape1)
(lock-shape f1-3f shape0)
(lock-shape f2-1f shape0)
(lock-shape f2-9f shape0)
(lock-shape f3-2f shape3)
(lock-shape f3-5f shape3)
(lock-shape f3-7f shape3)
(lock-shape f4-7f shape2)
(lock-shape f5-3f shape2)
(lock-shape f5-4f shape1)
(lock-shape f5-7f shape1)
(lock-shape f5-8f shape2)
(lock-shape f6-4f shape0)
(lock-shape f6-7f shape1)
(lock-shape f7-0f shape3)
(lock-shape f7-1f shape1)
(lock-shape f7-2f shape2)
(lock-shape f7-3f shape0)
(locked f0-7f)
(locked f0-8f)
(locked f1-3f)
(locked f2-9f)
(locked f4-7f)
(locked f5-3f)
(locked f5-4f)
(locked f5-7f)
(locked f5-8f)
(locked f6-4f)
(locked f7-0f)
(locked f7-2f)
(locked f7-3f)
(open f0-0f)
(open f0-1f)
(open f0-2f)
(open f0-3f)
(open f0-4f)
(open f0-5f)
(open f0-6f)
(open f0-9f)
(open f1-0f)
(open f1-1f)
(open f1-2f)
(open f1-4f)
(open f1-5f)
(open f1-6f)
(open f1-7f)
(open f1-8f)
(open f1-9f)
(open f2-0f)
(open f2-1f)
(open f2-2f)
(open f2-3f)
(open f2-4f)
(open f2-5f)
(open f2-6f)
(open f2-7f)
(open f2-8f)
(open f3-0f)
(open f3-1f)
(open f3-2f)
(open f3-3f)
(open f3-4f)
(open f3-5f)
(open f3-6f)
(open f3-7f)
(open f3-8f)
(open f3-9f)
(open f4-0f)
(open f4-1f)
(open f4-2f)
(open f4-3f)
(open f4-4f)
(open f4-5f)
(open f4-6f)
(open f4-8f)
(open f4-9f)
(open f5-0f)
(open f5-1f)
(open f5-2f)
(open f5-5f)
(open f5-6f)
(open f5-9f)
(open f6-0f)
(open f6-1f)
(open f6-2f)
(open f6-3f)
(open f6-5f)
(open f6-6f)
(open f6-7f)
(open f6-8f)
(open f6-9f)
(open f7-1f)
(open f7-4f)
(open f7-5f)
(open f7-6f)
(open f7-7f)
(open f7-8f)
(open f7-9f)
(open f8-0f)
(open f8-1f)
(open f8-2f)
(open f8-3f)
(open f8-4f)
(open f8-5f)
(open f8-6f)
(open f8-7f)
(open f8-8f)
(open f8-9f)
(open f9-0f)
(open f9-1f)
(open f9-2f)
(open f9-3f)
(open f9-4f)
(open f9-5f)
(open f9-6f)
(open f9-7f)
(open f9-8f)
(open f9-9f)
(place f0-0f)
(place f0-1f)
(place f0-2f)
(place f0-3f)
(place f0-4f)
(place f0-5f)
(place f0-6f)
(place f0-7f)
(place f0-8f)
(place f0-9f)
(place f1-0f)
(place f1-1f)
(place f1-2f)
(place f1-3f)
(place f1-4f)
(place f1-5f)
(place f1-6f)
(place f1-7f)
(place f1-8f)
(place f1-9f)
(place f2-0f)
(place f2-1f)
(place f2-2f)
(place f2-3f)
(place f2-4f)
(place f2-5f)
(place f2-6f)
(place f2-7f)
(place f2-8f)
(place f2-9f)
(place f3-0f)
(place f3-1f)
(place f3-2f)
(place f3-3f)
(place f3-4f)
(place f3-5f)
(place f3-6f)
(place f3-7f)
(place f3-8f)
(place f3-9f)
(place f4-0f)
(place f4-1f)
(place f4-2f)
(place f4-3f)
(place f4-4f)
(place f4-5f)
(place f4-6f)
(place f4-7f)
(place f4-8f)
(place f4-9f)
(place f5-0f)
(place f5-1f)
(place f5-2f)
(place f5-3f)
(place f5-4f)
(place f5-5f)
(place f5-6f)
(place f5-7f)
(place f5-8f)
(place f5-9f)
(place f6-0f)
(place f6-1f)
(place f6-2f)
(place f6-3f)
(place f6-4f)
(place f6-5f)
(place f6-6f)
(place f6-7f)
(place f6-8f)
(place f6-9f)
(place f7-0f)
(place f7-1f)
(place f7-2f)
(place f7-3f)
(place f7-4f)
(place f7-5f)
(place f7-6f)
(place f7-7f)
(place f7-8f)
(place f7-9f)
(place f8-0f)
(place f8-1f)
(place f8-2f)
(place f8-3f)
(place f8-4f)
(place f8-5f)
(place f8-6f)
(place f8-7f)
(place f8-8f)
(place f8-9f)
(place f9-0f)
(place f9-1f)
(place f9-2f)
(place f9-3f)
(place f9-4f)
(place f9-5f)
(place f9-6f)
(place f9-7f)
(place f9-8f)
(place f9-9f)
(shape shape0)
(shape shape1)
(shape shape2)
(shape shape3)
)
(:goal (and
(at key0-0 f0-2f)
(at key0-2 f1-1f)
(at key0-4 f3-9f)
(at key1-1 f6-7f)
(at key1-2 f0-6f)
(at key1-3 f2-0f)
(at key2-4 f0-0f)
(at key3-0 f0-4f)
(at key3-1 f4-8f)
(at key3-4 f3-4f)
))
)

; plan
1. (move f6-6f f7-6f)
   deleted: (at-robot f6-6f)
   added: (at-robot f7-6f)
   goals met: 9 of 10
2. (move f7-6f f8-6f)
   deleted: (at-robot f7-6f)
   added: (at-robot f8-6f)
   goals met: 9 of 10
3. (move f8-6f f9-6f)
   deleted: (at-robot f8-6f)
   added: (at-robot f9-6f)
   goals met: 9 of 10
4. (move f9-6f f9-7f)
   deleted: (at-robot f9-6f)
   added: (at-robot f9-7f)
   goals met: 9 of 10
5. (pickup f9-7f key0-2)
   deleted: (at key0-2 f9-7f) (arm-empty)
   added: (holding key0-2)
   goals met: 9 of 10
6. (move f9-7f f8-7f)
   deleted: (at-robot f9-7f)
   added: (at-robot f8-7f)
   goals met: 9 of 10
7. (move f8-7f f7-7f)
   deleted: (at-robot f8-7f)
   added: (at-robot f7-7f)
   goals met: 9 of 10
8. (move f7-7f f7-6f)
   deleted: (at-robot f7-7f)
   added: (at-robot f7-6f)
   goals met: 9 of 10
9. (move f7-6f f6-6f)
   deleted: (at-robot f7-6f)
   added: (at-robot f6-6f)
   goals met: 9 of 10
10. (move f6-6f f5-6f)
   deleted: (at-robot f6-6f)
   added: (at-robot f5-6f)
   goals met: 9 of 10
11. (move f5-6f f5-5f)
   deleted: (at-robot f5-6f)
   added: (at-robot f5-5f)
   goals met: 9 of 10
12. (move f5-5f f4-5f)
   deleted: (at-robot f5-5f)
   added: (at-robot f4-5f)
   goals met: 9 of 10
13. (move f4-5f f4-4f)
   deleted: (at-robot f4-5f)
   added: (at-robot f4-4f)
   goals met: 9 of 10
14. (move f4-4f f4-3f)
   deleted: (at-robot f4-4f)
   added: (at-robot f4-3f)
   goals met: 9 of 10
15. (move f4-3f f3-3f)
   deleted: (at-robot f4-3f)
   added: (at-robot f3-3f)
   goals met: 9 of 10
16. (move f3-3f f3-2f)
   deleted: (at-robot f3-3f)
   added: (at-robot f3-2f)
   goals met: 9 of 10
17. (move f3-2f f2-2f)
   deleted: (at-robot f3-2f)
   added: (at-robot f2-2f)
   goals met: 9 of 10
18. (move f2-2f f2-1f)
   deleted: (at-robot f2-2f)
   added: (at-robot f2-1f)
   goals met: 9 of 10
19. (move f2-1f f1-1f)
   deleted: (at-robot f2-1f)
   added: (at-robot f1-1f)
   goals met: 9 of 10
20. (putdown f1-1f key0-2)
   deleted: (holding key0-2)
   added: (arm-empty) (at key0-2 f1-1f)
   goals met: 10 of 10
